Revit 2027 API
InstanceVoidCutUtils.IsVoidInstanceCuttingElement Method
 Indicates if the element is a family instance with unattached voids that can cut other elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsVoidInstanceCuttingElement(
	Element element
)
Public Shared Function IsVoidInstanceCuttingElement (
	element As Element
) As Boolean
public:
static bool IsVoidInstanceCuttingElement(
	Element^ element
)
static member IsVoidInstanceCuttingElement :
        element : Element -> bool
Parameters
element Element
 The cutting family instance
Return Value
Boolean
 Returns true if the element is a family instance with unattached voids that can cut other elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A family instance can cut if the family has unattached voids and the family's parameter "Cut with Voids When Loaded" is checked.
See Also
Reference
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace